In [1]:
import pandas as pd

### Joining Two DataFrames 
A key is used to join the dataframes which can be any common column in both data frames .If no key column is defined then intersection columns are used.
Join is inner by default which is the intersection of keys .
Outer join is union of keys from both data frames 
left join is all the keys from the first data frame
right join is all the keys from the second data frame.
A key is the main component to join and it should be present in both data frames as column values.

In [62]:
df1 = pd.DataFrame({'reference':['ola','uber','tata','lyft','gojack','maruti'],'revenue':[1,2,3,4,5,6]})

In [63]:
df2 = pd.DataFrame({'reference':['ola','uber','lyft','gojack'],'revenue':[1,2,3,4]})

In [64]:
df3 = pd.merge(df1,df2,on = 'reference',how='outer')

In [65]:
df3

  reference  revenue_x  revenue_y
0       ola          1        1.0
1      uber          2        2.0
2      tata          3        NaN
3      lyft          4        3.0
4    gojack          5        4.0
5    maruti          6        NaN

In [66]:
df4 = pd.merge(df1,df2,on='reference',how='left')

In [80]:
df4

  reference  revenue_x  revenue_y
0       ola          1        1.0
1      uber          2        2.0
2      tata          3        NaN
3      lyft          4        3.0
4    gojack          5        4.0
5    maruti          6        NaN

### Concatenation

In [68]:
import numpy as np
from numpy import random

In [69]:
df1 = pd.DataFrame(np.arange(10).reshape(5,2))

In [70]:
df1

   0  1
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [71]:
df2 = pd.DataFrame(random.rand(5,2))

In [72]:
df2

          0         1
0  0.861787  0.589276
1  0.380997  0.081625
2  0.158943  0.965396
3  0.312028  0.573737
4  0.239107  0.678375

In [78]:
df3 = pd.concat([df1,df2],ignore_index=True,axis=1)

In [79]:
df3

   0  1         2         3
0  0  1  0.861787  0.589276
1  2  3  0.380997  0.081625
2  4  5  0.158943  0.965396
3  6  7  0.312028  0.573737
4  8  9  0.239107  0.678375

### Using Join() function to join two dataframes

In [94]:
df1 = pd.DataFrame({'reference':['ola','uber','tata','lyft','gojack','maruti'],'revenue':[1,2,3,4,5,6]})
df1

  reference  revenue
0       ola        1
1      uber        2
2      tata        3
3      lyft        4
4    gojack        5
5    maruti        6

In [95]:
df2 = pd.DataFrame({'reference':['ola','uber','lyft','gojack'],'revenue':[1,2,3,4]})
df2

  reference  revenue
0       ola        1
1      uber        2
2      lyft        3
3    gojack        4

In [97]:
df1.join(df2,lsuffix = '1',rsuffix='2')

  reference1  revenue1 reference2  revenue2
0        ola         1        ola       1.0
1       uber         2       uber       2.0
2       tata         3       lyft       3.0
3       lyft         4     gojack       4.0
4     gojack         5        NaN       NaN
5     maruti         6        NaN       NaN

### Using Combine_first() which replaces null values with the corresponding values from second dataframe.

In [84]:
df1 = pd.DataFrame([[1,2],[3,4],[np.nan,np.nan],[8,np.nan],[np.nan,3]])

In [82]:
df2 = pd.DataFrame(np.arange(10).reshape(5,2))

In [85]:
df1

     0    1
0  1.0  2.0
1  3.0  4.0
2  NaN  NaN
3  8.0  NaN
4  NaN  3.0

In [86]:
df2

   0  1
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [87]:
df3 = df1.combine_first(df2)

In [88]:
df3

     0    1
0  1.0  2.0
1  3.0  4.0
2  4.0  5.0
3  8.0  7.0
4  8.0  3.0